In [ ]:
%load_ext sql

In [ ]:
%sql sqlite:///ABC_DATA.db

In [ ]:
%%sql CREATE TABLE Customers(
    Customer_id INT(5) PRIMARY KEY,
    First_Name TEXT(50),
    Last_Name TEXT(50),
    Email TEXT(50)
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [ ]:
%%sql CREATE TABLE Products(
    Product_id INT(5) PRIMARY KEY,
    Product_Name TEXT(50),
    Price DECIMAL(5,2)
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [ ]:
%%sql CREATE TABLE Orders(
    Order_id INT(10) PRIMARY KEY,
    Customer_id INT(10),
    Order_date DATE,
FOREIGN KEY (Customer_id) REFERENCES Customers(Customer_id)
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [ ]:
%%sql CREATE TABLE Order_Items(
    Order_id INT(10),
    Product_id INT(10),
    Quantity INT(10),
    FOREIGN KEY (Order_id) REFERENCES Orders (Order_id),
    FOREIGN KEY (Product_id) REFERENCES Products (Product_id)
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [ ]:
%%sql INSERT INTO Customers(Customer_id,First_Name,Last_Name,Email) VALUES
(1, 'John', 'Doe', 'johndoe@email.com'),
    (2, 'Jane', 'Smith', 'janesmith@email.com'),
    (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
    (4, 'Alice', 'Brown', 'alicebrown@email.com'),
    (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
    (6, 'Eva', 'Fisher', 'evafisher@email.com'),
    (7, 'George', 'Harris', 'georgeharris@email.com'),
    (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
    (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
    (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
    (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
    (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
    (13, 'Sophia', 'Thomas', 'sophiathomas@email.com');

 * sqlite:///ABC_DATA.db
13 rows affected.

[]

In [ ]:
%%sql INSERT INTO Products(Product_id,Product_Name,Price) VALUES
(1, 'Product A', 10.01),
    (2, 'Product B', 15.01),
    (3, 'Product C', 20.01),
    (4, 'Product D', 25.01),
    (5, 'Product E', 30.01),
    (6, 'Product F', 35.01),
    (7, 'Product G', 40.01),
    (8, 'Product H', 45.01),
    (9, 'Product I', 50.01),
    (10, 'Product J', 55.01),
    (11, 'Product K', 60.01),
    (12, 'Product L', 65.01),
    (13, 'Product M', 70.01);

 * sqlite:///ABC_DATA.db
13 rows affected.

[]

In [ ]:
%%sql INSERT INTO Orders(Order_id,Customer_id,Order_date) VALUES
(1, 1, '2023-05-01'),
    (2, 2, '2023-05-02'),
    (3, 3, '2023-05-03'),
    (4, 1, '2023-05-04'),
    (5, 2, '2023-05-05'),
    (6, 3, '2023-05-06'),
    (7, 4, '2023-05-07'),
    (8, 5, '2023-05-08'),
    (9, 6, '2023-05-09'),
    (10, 7, '2023-05-10'),
    (11, 8, '2023-05-11'),
    (12, 9, '2023-05-12'),
    (13, 10, '2023-05-13'),
    (14, 11, '2023-05-14'),
    (15, 12, '2023-05-15'),
    (16, 13, '2023-05-16');

 * sqlite:///ABC_DATA.db
16 rows affected.

[]

In [ ]:
%%sql INSERT INTO Order_items(Order_id,Product_id,Quantity) VALUES
 (1, 1, 2),
    (1, 2, 1),
    (2, 2, 1),
    (2, 3, 3),
    (3, 1, 1),
    (3, 3, 2),
    (4, 2, 4),
    (4, 3, 1),
    (5, 1, 1),
    (5, 3, 2),
    (6, 2, 3),
    (6, 1, 1),
    (7, 4, 1),
    (7, 5, 2),
    (8, 6, 3),
    (8, 7, 1),
    (9, 8, 2),
    (9, 9, 1),
    (10, 10, 3),
    (10, 11, 2),
    (11, 12, 1),
    (11, 13, 3),
    (12, 4, 2),
    (12, 5, 1),
    (13, 6, 3),
    (13, 7, 2),
    (14, 8, 1),
    (14, 9, 2),
    (15, 10, 3),
    (15, 11, 1),
    (16, 12, 2),
    (16, 13, 3);

 * sqlite:///ABC_DATA.db
32 rows affected.

[]

In [ ]:
%sql SELECT * FROM Customers;

 * sqlite:///ABC_DATA.db
Done.

[(1, 'John', 'Doe', 'johndoe@email.com'),
 (2, 'Jane', 'Smith', 'janesmith@email.com'),
 (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
 (4, 'Alice', 'Brown', 'alicebrown@email.com'),
 (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
 (6, 'Eva', 'Fisher', 'evafisher@email.com'),
 (7, 'George', 'Harris', 'georgeharris@email.com'),
 (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
 (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
 (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
 (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
 (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
 (13, 'Sophia', 'Thomas', 'sophiathomas@email.com')]

In [ ]:
%sql SELECT * FROM Products;

 * sqlite:///ABC_DATA.db
Done.

[(1, 'Product A', 10.01),
 (2, 'Product B', 15.01),
 (3, 'Product C', 20.01),
 (4, 'Product D', 25.01),
 (5, 'Product E', 30.01),
 (6, 'Product F', 35.01),
 (7, 'Product G', 40.01),
 (8, 'Product H', 45.01),
 (9, 'Product I', 50.01),
 (10, 'Product J', 55.01),
 (11, 'Product K', 60.01),
 (12, 'Product L', 65.01),
 (13, 'Product M', 70.01)]

In [ ]:
%sql SELECT * FROM Orders;

 * sqlite:///ABC_DATA.db
Done.

[(1, 1, '2023-05-01'),
 (2, 2, '2023-05-02'),
 (3, 3, '2023-05-03'),
 (4, 1, '2023-05-04'),
 (5, 2, '2023-05-05'),
 (6, 3, '2023-05-06'),
 (7, 4, '2023-05-07'),
 (8, 5, '2023-05-08'),
 (9, 6, '2023-05-09'),
 (10, 7, '2023-05-10'),
 (11, 8, '2023-05-11'),
 (12, 9, '2023-05-12'),
 (13, 10, '2023-05-13'),
 (14, 11, '2023-05-14'),
 (15, 12, '2023-05-15'),
 (16, 13, '2023-05-16')]

In [ ]:
%sql SELECT * FROM Order_Items;

 * sqlite:///ABC_DATA.db
Done.

[(1, 1, 2),
 (1, 2, 1),
 (2, 2, 1),
 (2, 3, 3),
 (3, 1, 1),
 (3, 3, 2),
 (4, 2, 4),
 (4, 3, 1),
 (5, 1, 1),
 (5, 3, 2),
 (6, 2, 3),
 (6, 1, 1),
 (7, 4, 1),
 (7, 5, 2),
 (8, 6, 3),
 (8, 7, 1),
 (9, 8, 2),
 (9, 9, 1),
 (10, 10, 3),
 (10, 11, 2),
 (11, 12, 1),
 (11, 13, 3),
 (12, 4, 2),
 (12, 5, 1),
 (13, 6, 3),
 (13, 7, 2),
 (14, 8, 1),
 (14, 9, 2),
 (15, 10, 3),
 (15, 11, 1),
 (16, 12, 2),
 (16, 13, 3)]

**Question 1: Which product had the highest price?**

In [ ]:
%sql SELECT * FROM Products ORDER BY Price DESC;

 * sqlite:///ABC_DATA.db
Done.

[(13, 'Product M', 70.01),
 (12, 'Product L', 65.01),
 (11, 'Product K', 60.01),
 (10, 'Product J', 55.01),
 (9, 'Product I', 50.01),
 (8, 'Product H', 45.01),
 (7, 'Product G', 40.01),
 (6, 'Product F', 35.01),
 (5, 'Product E', 30.01),
 (4, 'Product D', 25.01),
 (3, 'Product C', 20.01),
 (2, 'Product B', 15.01),
 (1, 'Product A', 10.01)]

Answer 1: Product M had the highest price.

**Question 2: Which Order_id had the highest number of items in terms of quantity?**

In [ ]:
%sql SELECT Order_id, SUM(Quantity) AS Total_Items FROM Order_Items GROUP BY Order_id ORDER BY Total_Items DESC;

 * sqlite:///ABC_DATA.db
Done.

[(16, 5),
 (13, 5),
 (10, 5),
 (4, 5),
 (15, 4),
 (11, 4),
 (8, 4),
 (6, 4),
 (2, 4),
 (14, 3),
 (12, 3),
 (9, 3),
 (7, 3),
 (5, 3),
 (3, 3),
 (1, 3)]

Answer 2: Order_ids 16, 13, 10 and 4 had the highest number of items in terms of quantity.

**Question 3: Which customer has made the most orders?**

In [ ]:
%sql select * from Customers limit 5;

 * sqlite:///ABC_DATA.db
Done.

[(1, 'John', 'Doe', 'johndoe@email.com'),
 (2, 'Jane', 'Smith', 'janesmith@email.com'),
 (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
 (4, 'Alice', 'Brown', 'alicebrown@email.com'),
 (5, 'Charlie', 'Davis', 'charliedavis@email.com')]

In [ ]:
%sql select * from Orders limit 5;

 * sqlite:///ABC_DATA.db
Done.

[(1, 1, '2023-05-01'),
 (2, 2, '2023-05-02'),
 (3, 3, '2023-05-03'),
 (4, 1, '2023-05-04'),
 (5, 2, '2023-05-05')]

In [ ]:
%sql select * from Order_Items limit 5;

 * sqlite:///ABC_DATA.db
Done.

[(1, 1, 2), (1, 2, 1), (2, 2, 1), (2, 3, 3), (3, 1, 1)]

In [ ]:
%%sql select Customers.First_name, Orders.Order_id, Order_Items.Quantity
from Customers inner join Orders on Customers.Customer_id = Orders.Customer_id
inner join Order_Items on Orders.Order_id = Order_Items.Order_id;

 * sqlite:///ABC_DATA.db
Done.

[('John', 1, 2),
 ('John', 1, 1),
 ('Jane', 2, 1),
 ('Jane', 2, 3),
 ('Bob', 3, 1),
 ('Bob', 3, 2),
 ('John', 4, 4),
 ('John', 4, 1),
 ('Jane', 5, 1),
 ('Jane', 5, 2),
 ('Bob', 6, 3),
 ('Bob', 6, 1),
 ('Alice', 7, 1),
 ('Alice', 7, 2),
 ('Charlie', 8, 3),
 ('Charlie', 8, 1),
 ('Eva', 9, 2),
 ('Eva', 9, 1),
 ('George', 10, 3),
 ('George', 10, 2),
 ('Ivy', 11, 1),
 ('Ivy', 11, 3),
 ('Kevin', 12, 2),
 ('Kevin', 12, 1),
 ('Lily', 13, 3),
 ('Lily', 13, 2),
 ('Oliver', 14, 1),
 ('Oliver', 14, 2),
 ('Quinn', 15, 3),
 ('Quinn', 15, 1),
 ('Sophia', 16, 2),
 ('Sophia', 16, 3)]

Answer 3: John is the customer with the most orders.

**NB: Help me see how I can include a command for showing the above results as customer first name and corresponding items bought as sum (quantity).**

**Question 4: What's the total revenue per product?**

In [ ]:
%%sql select Products.Product_Name, Products.Price, Order_Items.Quantity
from Products left join Order_Items on Products.Product_id = Order_Items.Product_id;

 * sqlite:///ABC_DATA.db
Done.

[('Product A', 10.01, 1),
 ('Product A', 10.01, 1),
 ('Product A', 10.01, 1),
 ('Product A', 10.01, 2),
 ('Product B', 15.01, 1),
 ('Product B', 15.01, 1),
 ('Product B', 15.01, 3),
 ('Product B', 15.01, 4),
 ('Product C', 20.01, 1),
 ('Product C', 20.01, 2),
 ('Product C', 20.01, 2),
 ('Product C', 20.01, 3),
 ('Product D', 25.01, 1),
 ('Product D', 25.01, 2),
 ('Product E', 30.01, 1),
 ('Product E', 30.01, 2),
 ('Product F', 35.01, 3),
 ('Product F', 35.01, 3),
 ('Product G', 40.01, 1),
 ('Product G', 40.01, 2),
 ('Product H', 45.01, 1),
 ('Product H', 45.01, 2),
 ('Product I', 50.01, 1),
 ('Product I', 50.01, 2),
 ('Product J', 55.01, 3),
 ('Product J', 55.01, 3),
 ('Product K', 60.01, 1),
 ('Product K', 60.01, 2),
 ('Product L', 65.01, 1),
 ('Product L', 65.01, 2),
 ('Product M', 70.01, 3),
 ('Product M', 70.01, 3)]

**How can I group by product name and order by total revenue?**

**Question 5: Find the first order (by date) for each customer.**

In [ ]:
%%sql select Customers.First_Name, Customers.Last_Name, Orders.Order_date
from Customers left join Orders on Customers.Customer_id = Orders.Customer_id
order by Order_date asc;

 * sqlite:///ABC_DATA.db
Done.

[('John', 'Doe', '2023-05-01'),
 ('Jane', 'Smith', '2023-05-02'),
 ('Bob', 'Johnson', '2023-05-03'),
 ('John', 'Doe', '2023-05-04'),
 ('Jane', 'Smith', '2023-05-05'),
 ('Bob', 'Johnson', '2023-05-06'),
 ('Alice', 'Brown', '2023-05-07'),
 ('Charlie', 'Davis', '2023-05-08'),
 ('Eva', 'Fisher', '2023-05-09'),
 ('George', 'Harris', '2023-05-10'),
 ('Ivy', 'Jones', '2023-05-11'),
 ('Kevin', 'Miller', '2023-05-12'),
 ('Lily', 'Nelson', '2023-05-13'),
 ('Oliver', 'Patterson', '2023-05-14'),
 ('Quinn', 'Roberts', '2023-05-15'),
 ('Sophia', 'Thomas', '2023-05-16')]

First order by date for each customer as follows:

John: 2023-05-01

Jane: 2023-05-02

Bob: 2023-05-04

Alice: 2023-05-07

Charlie: 2023-05-08

Eva: 2023-05-09

George: 2023-05-10

Ivy: 2023-05-11

Kevin: 2023-05-12

Lily: 2023-05-13

Oliver: 2023-05-14

Quinn: 2023-05-15

Sophia: 2023-05-16

**Question 6: Find the day with the highest revenue.**

**Help on this query!**